Messwerte/Archiv/Raw/apache_benchmark_repeat35/min/default/go-httpd/target_count_21/repeat_24/13.txt
2020/01/19 19:27:08 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8013/
2020/01/19 19:27:38 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 35919 requests
Server Software:        
Server Hostname:        192.168.3.100
Server Port:            8013
Document Path:          /
Document Length:        26 bytes
Concurrency Level:      100
Time taken for tests:   30.002 seconds
Complete requests:      35919
Failed requests:        0
Total transferred:      5136417 bytes
HTML transferred:       933894 bytes
Requests per second:    1197.22 [#/sec] (mean)
Time per request:       83.527 [ms] (mean)
Time per request:       0.835 [ms] (mean, across all concurrent requests)
Transfer rate:          167.19 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        2   68 245.7     11    3052
Processing:     1   14  87.4      6    2430
Waiting:        0   13  87.3      6    2430
Total:          3   82 270.2     16    3464
Percentage of the requests served within a certain time (ms)
  50%     16
  66%     17
  75%     18
  80%     18
  90%     24
  95%   1022
  98%   1037
  99%   1042
 100%   3464 (longest request)
2020/01/19 19:27:38 Matched stat line [Connect:        2   68 245.7     11    3052 Connect 2 68 245.7 11 3052]
2020/01/19 19:27:38 Matched stat line [Processing:     1   14  87.4      6    2430 Processing 1 14 87.4 6 2430]
2020/01/19 19:27:38 Matched stat line [Waiting:        0   13  87.3      6    2430 Waiting 0 13 87.3 6 2430]
2020/01/19 19:27:38 Matched stat line [Total:          3   82 270.2     16    3464 Total 3 82 270.2 16 3464]
2020/01/19 19:27:38 Matched percentline [  50%     16 50 16]
2020/01/19 19:27:38 Matched percentline [  66%     17 66 17]
2020/01/19 19:27:38 Matched percentline [  75%     18 75 18]
2020/01/19 19:27:38 Matched percentline [  80%     18 80 18]
{"connect":{"max":3052,"mean":68,"median":11,"min":2,"stdDev":245.6999969482422},"percentiles":{"100":3464,"50":16,"66":17,"75":18,"80":18,"90":24,"95":1022,"98":1037,"99":1042},"processing":{"max":2430,"mean":14,"median":6,"min":1,"stdDev":87.4000015258789},"total":{"max":3464,"mean":82,"median":16,"min":3,"stdDev":270.20001220703125},"waiting":{"max":2430,"mean":13,"median":6,"min":0,"stdDev":87.30000305175781}}
2020/01/19 19:27:38 Matched percentline [  90%     24 90 24]
2020/01/19 19:27:38 Matched percentline [  95%   1022 95 1022]
2020/01/19 19:27:38 Matched percentline [  98%   1037 98 1037]
2020/01/19 19:27:38 Matched percentline [  99%   1042 99 1042]
2020/01/19 19:27:38 Matched percentline [ 100%   3464 100 3464]